/************************************************************************
* 模块名称：LM75模块
* 文件名  ：BSP_SENSOR_LM75.h
* 说明    ：头文件，提供自定义数据类型及外部调用的接口函数
* 版 本 号：V2.0
* 修改记录：
*		    版本号       日期        作者                 
*		    V2.0     2021-01-24     qiqiang        
***********************************************************************/

#ifndef __BSP_SENSOR_LM75_H
#define __BSP_SENSOR_LM75_H

/***************************************************************
                        本模块包含的头文件
***************************************************************/


/***************************************************************
                   本模块提供给外部调用的函数
****************************************************************/

void  BSP_UpdateSensorValue(void);      // 更新传感器数据（软件滤波）
float BSP_GetSensorValue(void);         // 读取传感器数据
// 设置传感器阈值
void  BSP_SetSensorRange(float upRange,float lowRange);
float BSP_GetSensor_UpRange(void);      // 读取传感器阈值上限
float BSP_GetSensor_LowRange(void);     // 读取传感器阈值下限

/***************************************************************
                     本模块的内部函数
****************************************************************/
static float Get_Sensor_Raw_Value(void); // 读取传感器原始数据
static float Sensor_Filter(void);        // 传感器数据滤波处理

#endif
